<?php
/**
 * データを削除する
 *   パターン2:
 *     削除フラグを立てる
 */

//-------------------------------------------
// ライブラリ
//-------------------------------------------
require_once('common.php');

//-------------------------------------------
// データを削除
//-------------------------------------------
// 削除対象のID
$target_id = 'sm1018';

// ファイルからIDを探し出して削除する
$fp = fopen(DATA_FILE, 'r+');
while( $buff = fscanf($fp, '%1d%10s%128s%5s%5s') ){
	list($flag, $id, $title, $format, $length) = $buff;

	// 削除フラグを立てる
	if( $flag === 1 && $id === $target_id ){
		fseek($fp, (1 + 10 + 128 + 5 + 5 + 1) * -1, SEEK_CUR);
		fwrite($fp, '0');
		break;
	}
}
fclose($fp);
